### Query loan database with SQL

Establish connection to SQL database.

In [104]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [105]:
%sql mysql+mysqldb://root:********@localhost/assignment

Find data points that contain "#N/A" as category

In [106]:
%%sql

SELECT category, name
FROM merchant_category_mapping
JOIN merchant_name_mapping
ON merchant_category_mapping.merchant_id = merchant_name_mapping.merchant_id
WHERE category = '#N/A';

 * mysql+mysqldb://root:***@localhost/assignment
2 rows affected.

[('#N/A', 'BUOLYBH'), ('#N/A', 'LYMLCLF')]

Find data points that contain '#N/A' as subcategory

In [107]:
%%sql

SELECT subcategory, name
FROM merchant_category_mapping
JOIN merchant_name_mapping
ON merchant_category_mapping.merchant_id = merchant_name_mapping.merchant_id
WHERE subcategory = '#N/A';

 * mysql+mysqldb://root:***@localhost/assignment
7 rows affected.

[('#N/A', 'PIYXFMT'),
 ('#N/A', 'VRCTBDG'),
 ('#N/A', 'LOMGEQM'),
 ('#N/A', 'WHOJNDV'),
 ('#N/A', 'GFVUDGC'),
 ('#N/A', 'OXLOFHO'),
 ('#N/A', 'QAYXIAW')]

Categories that generate the most profit for company XYZ.

In [115]:
%%sql

SELECT category, SUM(avg_loan_amt * avg_term * avg_apr * num_trxn - (1 - actual_repayment_pct) * avg_loan_amt * num_trxn) AS profit
FROM performance_dataset
JOIN merchant_category_mapping
ON merchant_category_mapping.merchant_id = performance_dataset.merchant_id
GROUP BY category
ORDER BY profit DESC;

 * mysql+mysqldb://root:***@localhost/assignment
10 rows affected.

[('WOMENS_FASHION', 6423880.836323),
 ('OTHER', 3355830.869684),
 ('#N/A', 2743487.032351),
 ('JEWELRY', 1051483.913377),
 ('HOME_FURNISHINGS', 924745.923717),
 ('CONSUMER_ELECTRONICS', 512509.424541),
 ('AUTO_PARTS', 342822.676025),
 ('PERSONAL_SERVICE', 292124.02178),
 ('BEAUTY', 12929.26465),
 ('MENS_FASHION', 2125.790126)]

Show number of transactions and profitability to determine which categories should be expanded and which should be abandoned.

In [135]:
%%sql

SELECT category, SUM(num_trxn) AS num_trxn, AVG((avg_loan_amt * avg_term * avg_apr * num_trxn - (1 - actual_repayment_pct) * avg_loan_amt * num_trxn) / avg_loan_amt) AS profitability
FROM performance_dataset
JOIN merchant_category_mapping
ON merchant_category_mapping.merchant_id = performance_dataset.merchant_id
GROUP BY category
ORDER BY num_trxn DESC;

 * mysql+mysqldb://root:***@localhost/assignment
10 rows affected.

[('WOMENS_FASHION', Decimal('7140'), 1714.1399500519037),
 ('HOME_FURNISHINGS', Decimal('3686'), 29.88247856967861),
 ('#N/A', Decimal('2680'), 2216.1924862861633),
 ('OTHER', Decimal('2033'), 62.78863830360729),
 ('JEWELRY', Decimal('844'), 73.18642261624336),
 ('CONSUMER_ELECTRONICS', Decimal('430'), 90.53206934441219),
 ('AUTO_PARTS', Decimal('215'), 88.80703204870224),
 ('PERSONAL_SERVICE', Decimal('109'), 121.43529995530844),
 ('BEAUTY', Decimal('50'), 93.83284747600555),
 ('MENS_FASHION', Decimal('10'), 5.46392023563385)]

Show the differences between predicted and actual repayments by category.

In [154]:
%%sql

SELECT category, AVG(actual_repayment_pct - predicted_repayment_pct)  AS payment_variance
FROM performance_dataset
JOIN merchant_category_mapping
ON merchant_category_mapping.merchant_id = performance_dataset.merchant_id
GROUP BY category
ORDER BY payment_variance DESC;

 * mysql+mysqldb://root:***@localhost/assignment
10 rows affected.

[('MENS_FASHION', 0.0459560156),
 ('HOME_FURNISHINGS', 0.0229419555),
 ('JEWELRY', 0.0228856206),
 ('PERSONAL_SERVICE', 0.0185915232),
 ('CONSUMER_ELECTRONICS', 0.0010984594),
 ('#N/A', -0.0008634925),
 ('WOMENS_FASHION', -0.0118229985),
 ('AUTO_PARTS', -0.0468440056),
 ('OTHER', -0.055305766),
 ('BEAUTY', -0.1396030188)]